app/Http/Middleware/WebHelper.php

    public function handle(Request $request, Closure $next)
    {
        //its just a dummy data object.
        $data = Website::first();
        $menu = FrontMenu::all();
        $agenda = Agenda::all()->count();
        $news = News::all()->count();
        $public_complaints = Complaint::all()->count();
        $gallery = Gallery::all()->count();
        $counter = Counter::all()->count();
        $inbox = Inbox::all()->count();
        $related = RelatedLink::all();
---
SELECT * FROM `websites` LIMIT 1
SELECT * FROM `front_menus` WHERE `front_menus`.`deleted_at` IS NULL
SELECT * FROM `related_links`