routes/web.php

    function () {
        \UniSharp\LaravelFilemanager\Lfm::routes();
    }
);

Route::get('/', function () {
    $themes = Website::all()->first();
    if (Website::all()->count() != 0) {
        $geoipInfo = geoip()->getLocation($_SERVER['REMOTE_ADDR']);
        $data = [
            'ip' => $geoipInfo->ip,
            'iso_code' => $geoipInfo->iso_code,
            'country' => $geoipInfo->country,
            'city' => $geoipInfo->city,
            'state' => $geoipInfo->state,
            'state_name' => $geoipInfo->state_name,
            'postal_code' => $geoipInfo->postal_code,
            'lat' => $geoipInfo->lat,
            'lon' => $geoipInfo->lon,
            'timezone' => $geoipInfo->timezone,
            'continent' => $geoipInfo->continent,
            'currency' => $geoipInfo->currency,
        ];
        Seo::seO();
        Counter::create($data);

        $response = Http::withoutVerifying()->get('https://diskominfo.wonosobokab.go.id/api/news');
        $response = $response->collect();
        $berita =   array_slice($response['data']['data'], 0, 3);
        $gallery = Gallery::orderBy('created_at', 'desc')->paginate(12);
        $news = News::orderBy('date', 'desc')->paginate(9);
        return view('front.' . $themes->themes_front . '.pages.index', compact('gallery', 'news', 'berita'));
    } else {
        $data = Themes::all();
        return view('front.setup', compact('data'));
    }
})->name('root')->middleware('data_web');

Route::group(['middleware' => 'data_web'], function () {
    Route::get('/detail-berita/{id}', [FrontController::class, 'detailberita'])->name('detail-berita');
    Route::get('/news-detail/{slug}', [FrontController::class, 'newsdetail'])->name('news.detail');
    Route::get('/news-author/{id}', [FrontController::class, 'newsbyauthor'])->name('news.author');
    Route::get('/news-search', [FrontController::class, 'newsbysearch'])->name('news.search');
    Route::get('/newsall', [FrontController::class, 'newsall'])->name('news.all');
    Route::get('/photos', [FrontController::class, 'galleryall'])->name('photo.all');
    Route::post('/setup', [FrontController::class, 'setup'])->name('setup-first');
    Route::get('/tentang-kami', [FrontController::class, 'tentangkami'])->name('tentang-kami');
    Route::get('/latar-belakang', [FrontController::class, 'latarbelakang'])->name('latar-belakang');
    Route::get('/tujuan', [FrontController::class, 'tujuan'])->name('tujuan');
    Route::get('/kampung-pancasila', [FrontController::class, 'kampungpancasila'])->name('kampung-pancasila');
    Route::get('/page/{id}', [FrontController::class, 'page'])->name('page');
    Route::get('/component/{id}', [FrontController::class, 'component'])->name('component');
    Route::get('/load-sql', [FrontController::class, 'loadsql']);
    Route::get('/check', [FrontController::class, 'check']);
    Route::post('kotakmasuk', [FrontController::class, 'inbox']);
    Route::post('guest', [FrontController::class, 'addguest']);
    Route::resource('buku-tamu', GuestBookController::class);
    Route::get('agenda', [FrontController::class, 'event']);
    Route::get('berita', [FrontController::class, 'newsall']);
    Route::get('/reload-captcha', [FrontController::class, 'reloadCaptcha']);
    Route::post('permohonaninformasi', [PermohonanInformasiController::class, 'store']);
});

Route::middleware(['auth:sanctum', 'verified', 'data_web'])->get('/dashboard', function () {
    $themes = Website::all()->first();
    return view($themes->themes_back . '.pages.dashboard');
})->name('dashboard');
---
select * from `websites`
select exists(select * from `websites`) as `exists`
select * from `websites` limit 1
insert into `counters` (`ip`, `iso_code`, `country`, `city`, `state`, `state_name`, `postal_code`, `lat`, `lon`, `timezone`, `continent`, `currency`, `updated_at`, `created_at`) values ('127.0.0.0', 'US', 'United States', 'New Haven', 'CT', 'Connecticut', '06510', 41.31, -72.92, 'America/New_York', 'NA', 'USD', '2023-01-19 03:39:24', '2023-01-19 03:39:24')
select * from `news` where `news`.`deleted_at` is null order by `date` desc limit 9 offset 0
select count(*) as aggregate from `galleries` where `galleries`.`deleted_at` is null
select * from `galleries` where `galleries`.`deleted_at` is null order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `news` where `news`.`deleted_at` is null