routes/web.php

    Seo::seO();
    Counter::create($data);

    $news = News::with('gambar', 'gambarmuka', 'uploader')->where('terbit', 1)->orderBy('date', 'desc')->paginate(3);
---
select * from `news` where `terbit` = 1 and `news`.`deleted_at` is null order by `date` desc limit 3 offset 0
select count(*) as aggregate from `news` where `terbit` = 1 and `news`.`deleted_at` is null