app/Helpers/Seo.php

    public static function seO()
    {
        $data = Website::all()->first();
---
select * from `websites`