app/Http/Controllers/ComponentController.php

select * from `components` order by `name` asc
---
    public function index(Request $request)
    {
        if ($request->ajax()) {
            $data = Component::orderBy('name', 'ASC')->get();

select * from `components` where `components`.`id` = '5' limit 1
update `components` set `active` = 0 where `id` = 5
---
    public function changeAccess(Request $request)
    {
        $comp = Component::find($request->id);
        if ($comp->active == 1) {
            DB::table('components')
                ->where('id', $comp->id)
                ->update(['active' => 0]);