app/Http/Controllers/CredentialController.php

select * from `users` where `users`.`id` = '2' limit 1
---
    public function edit($id)
    {
        $data = User::find($id);