app/Http/Controllers/FrontController.php

    public function komentar(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'name' => 'required',
            'email' => 'required|email',
            'comments' => 'required',
            'captcha' => 'required|captcha',
        ]);

        if ($validator->fails()) {
            Alert::error('Failed', 'Gagal Menyimpan Komentar');
            return redirect()->back()->withErrors($validator)->withInput();
        } else {
            Comment::create([
                'name' => $request->name,
                'email' => $request->email,
                'comments' => $request->comments,
                'news_id' => $request->id,
            ]);
---
insert into `comments` (`name`, `email`, `comments`, `news_id`, `updated_at`, `created_at`) values ('asdas', 'asd@asd.com', 'asdas', '1', '2023-10-03 13:42:32', '2023-10-03 13:42:32')