app/Http/Controllers/FrontController.php

select count(*) as aggregate from `galleries` where `galleries`.`deleted_at` is null
---
    public function galleryall(Request $request)
    {
        Seo::SeO();
        $gallery = Gallery::orderBy('created_at', 'desc')->paginate(9);