app/Http/Controllers/FrontController.php

select * from `websites`
---
    public function __construct()
    {
        $this->themes = Website::all()->first();

select * from `news` where `slug` = 'test-upload' and `news`.`deleted_at` is null limit 1
select * from `news` where `news`.`deleted_at` is null order by `date` desc limit 5 offset 0
select count(*) as aggregate from `news` where `news`.`deleted_at` is null
select * from `files` where `id_news` is null
---
    public function newsdetail($slug)
    {
        Seo::seO();
        $data = News::with('gambar')->where('slug', $slug)->first();
        views($data)->cooldown(5)->record();
        $news = News::with('gambar')->orderBy('date', 'desc')->paginate(5);
        $file = File::where('id_news', $data->attachment)->get();

select * from `news` where (date(`date`) like '%ziarah%' or `title` like '%ziarah%') and `news`.`deleted_at` is null order by `date` desc limit 15 offset 0
select count(*) as aggregate from `news` where (date(`date`) like '%ziarah%' or `title` like '%ziarah%') and `news`.`deleted_at` is null
select * from `news` where `news`.`deleted_at` is null order by `date` desc limit 5
---
    public function newsBySearch(Request $request)
    {
        Seo::seO();
        $cari = $request->kolomcari;
        $hasil = 'Search result : ' . $cari;
        $data = News::with('gambar')->whereDate('date', 'like', '%' . $cari . '%')->orWhere('title', 'like', '%' . $cari . '%')->orderBy("date", "desc")->paginate();
        $news = News::latest('date')->take(5)->get();

select * from `news` where `news`.`deleted_at` is null order by `date` desc limit 12 offset 0
select count(*) as aggregate from `news` where `news`.`deleted_at` is null
select * from `news` where `news`.`deleted_at` is null order by `date` desc limit 5
---
    public function newsall(Request $request)
    {
        Seo::seO();
        $news = News::latest('date')->paginate(12);
        $sideposts = News::latest('date')->take(5)->get();

select * from `news` where `kategori` = 'KATEGORI_NEWS_1' and `news`.`deleted_at` is null order by `date` desc limit 12 offset 0
select count(*) as aggregate from `news` where `kategori` = 'KATEGORI_NEWS_1' and `news`.`deleted_at` is null
select * from `news` where `news`.`deleted_at` is null order by `date` desc limit 5
---
    public function newsByCategory($id)
    {
        Seo::seO();
        $news = News::where('kategori', $id)->latest('date')->paginate(12);
        $sideposts = News::latest('date')->take(5)->get();