app/Http/Controllers/GalleryController.php

select * from `galleries` where `galleries`.`deleted_at` is null
---
    public function index(Request $request)
    {
        if ($request->ajax()) {
            $data = Gallery::all();

insert into `galleries` (`name`, `path`, `description`, `upload_date`, `updated_at`, `created_at`) values ('bbm5.png', 'gallery/9l7PO1aXAhuj0ocvoj5U2eJ7E2mTf3kQNPkqJOqP.png', 'kuntul 2', '2023-01-19', '2023-01-19 05:19:48', '2023-01-19 05:19:48')
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'photo' => 'required|image|max:12048',
            'description' => 'required',
        ]);
        $name = $request->file('photo')->getClientOriginalName();
        $path = $request->file('photo')->store('gallery');
        $data = [
            'name' => $name,
            'path' => $path,
            'description' => $request->description,
        ];
        Gallery::create($data);

select * from `galleries` where `galleries`.`id` = '1' and `galleries`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        $data = Gallery::find($id);