app/Http/Controllers/GuestBookController.php

    public function __construct()
    {
        $this->themes = Website::all()->first();
---
select * from `websites`